<html><head><META http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"><title>&#24212;&#29992;&#26381;&#21153;&#22120;&#30693;&#35782;&#27010;&#36848;</title><meta content="DocBook XSL-NS Stylesheets V1.75.2" name="generator"><link rel="home" href="index.html" title="PKUAS 2010 &#25216;&#26415;&#25163;&#20876;"><link rel="up" href="ch14.html" title="&#31532;&nbsp;14&nbsp;&#31456;&nbsp;PKUAS&#24212;&#29992;&#24320;&#21457;&#25351;&#21335;"><link rel="prev" href="ch14.html" title="&#31532;&nbsp;14&nbsp;&#31456;&nbsp;PKUAS&#24212;&#29992;&#24320;&#21457;&#25351;&#21335;"><link rel="next" href="ch14s03.html" title="&#20934;&#22791;&#24037;&#20316;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table summary="Navigation header" width="100%"><tr><th align="center" colspan="3">&#24212;&#29992;&#26381;&#21153;&#22120;&#30693;&#35782;&#27010;&#36848;</th></tr><tr><td align="left" width="20%"><a accesskey="p" href="ch14.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><th align="center" width="60%">&#31532;&nbsp;14&nbsp;&#31456;&nbsp;PKUAS&#24212;&#29992;&#24320;&#21457;&#25351;&#21335;</th><td align="right" width="20%">&nbsp;<a accesskey="n" href="ch14s03.html">&#19979;&#19968;&#39029;</a></td></tr></table><hr></div><div class="sect1" title="&#24212;&#29992;&#26381;&#21153;&#22120;&#30693;&#35782;&#27010;&#36848;"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="N213FE"></a>&#24212;&#29992;&#26381;&#21153;&#22120;&#30693;&#35782;&#27010;&#36848;</h2></div></div></div>
		<div class="sect2" title="&#20160;&#20040;&#26159;&#24212;&#29992;&#26381;&#21153;&#22120;"><div class="titlepage"><div><div><h3 class="title"><a name="N21402"></a>&#20160;&#20040;&#26159;&#24212;&#29992;&#26381;&#21153;&#22120;</h3></div></div></div>
			<p>&#19968;&#33324;&#30340;&#65292;&#36719;&#20214;&#21487;&#20197;&#34987;&#21010;&#20998;&#20026;&#19977;&#31867;&#65306;&#31995;&#32479;&#36719;&#20214;&#12289;&#25903;&#25745;&#36719;&#20214;&#21644;&#24212;&#29992;&#36719;&#20214;&#12290;</p>
			<p>&#20854;&#20013;&#65292;&#31995;&#32479;&#36719;&#20214;&#20027;&#35201;&#26159;&#25351;&#25805;&#20316;&#31995;&#32479;&#31561;&#19982;&#31995;&#32479;&#36164;&#28304;&#23494;&#20999;&#30456;&#20851;&#30340;&#36719;&#20214;&#65292;&#24120;&#35265;&#30340;&#22914;MS Window&#31995;&#21015;&#21644;Unix&#31995;&#21015;OS&#65292;&#37117;&#21487;&#20197;&#34987;&#30475;&#20316;&#26159;&#31995;&#32479;&#36719;&#20214;&#65307;&#25903;&#25745;&#36719;&#20214;&#26159;&#25351;&#36719;&#20214;&#24320;&#21457;&#24037;&#20855;&#31561;&#25903;&#25345;&#24320;&#21457;&#36807;&#31243;&#20013;&#30340;&#36719;&#20214;&#65292;&#24120;&#35265;&#30340;IDE&#23601;&#23646;&#20110;&#36825;&#31181;&#36719;&#20214;&#65307;&#36825;&#20004;&#31181;&#36719;&#20214;&#21487;&#20197;&#21512;&#31216;&#20026;&#22522;&#30784;&#36719;&#20214;&#12290;&#24212;&#29992;&#36719;&#20214;&#25351;&#29305;&#23450;&#20110;&#24212;&#29992;&#39046;&#22495;&#30340;&#19987;&#29992;&#36719;&#20214;&#12290;</p>
			<p>&#25105;&#20204;&#25152;&#35201;&#25506;&#35752;&#30340;&#24212;&#29992;&#26381;&#21153;&#22120;&#26159;&#19968;&#31181;&#20026;&#26041;&#20415;&#24212;&#29992;&#36719;&#20214;&#24320;&#21457;&#19982;&#32500;&#25252;&#32780;&#36880;&#27493;&#24418;&#25104;&#30340;&#22522;&#30784;&#36719;&#20214;&#65306;&#24212;&#29992;&#26381;&#21153;&#22120;&#26159;&#32593;&#32476;&#29615;&#22659;&#20013;&#24212;&#29992;&#31995;&#32479;&#30340;&#39640;&#23618;&#36816;&#34892;&#24179;&#21488;&#65307;&#23427;&#20351;&#24212;&#29992;&#31995;&#32479;&#30340;&#20195;&#30721;&#26356;&#20026;&#31616;&#21333;&#65292;&#20351;&#24320;&#21457;&#20154;&#21592;&#30340;&#31934;&#21147;&#21487;&#20197;&#26356;&#21152;&#38598;&#20013;&#20110;&#31995;&#32479;&#30340;&#36923;&#36753;&#37096;&#20998;&#12290;&#65288;&#12298;&#24212;&#29992;&#26381;&#21153;&#22120;&#21407;&#29702;&#19982;&#23454;&#29616;&#12299;&#65289;</p>
		</div>
		<div class="sect2" title="&#24212;&#29992;&#26381;&#21153;&#22120;&#30340;&#20986;&#29616;&#29615;&#22659;"><div class="titlepage"><div><div><h3 class="title"><a name="N21410"></a>&#24212;&#29992;&#26381;&#21153;&#22120;&#30340;&#20986;&#29616;&#29615;&#22659;</h3></div></div></div>
			<p>&#32593;&#32476;&#36719;&#20214;&#65288;&#20998;&#24067;&#22312;&#32593;&#32476;&#29615;&#22659;&#20013;&#30340;&#36719;&#20214;&#31995;&#32479;&#65289;&#19981;&#21516;&#20110;&#21333;&#26426;&#29615;&#22659;&#20013;&#30340;&#36719;&#20214;&#65306;&#23427;&#35201;&#27714;&#20998;&#24067;&#22312;&#32593;&#32476;&#20013;&#30340;&#21508;&#20010;&#33410;&#28857;&#33021;&#22815;&#30456;&#20114;&#21327;&#20316;&#20174;&#32780;&#20849;&#21516;&#23436;&#25104;&#30446;&#26631;&#20219;&#21153;&#65292;&#22240;&#27492;&#32593;&#32476;&#36719;&#20214;&#24517;&#38656;&#35299;&#20915;&#32593;&#32476;&#29615;&#22659;&#37324;&#20998;&#24067;&#24615;&#12289;&#21487;&#38752;&#24615;&#12289;&#23433;&#20840;&#24615;&#31561;&#38382;&#39064;&#12290;&#35299;&#20915;&#36825;&#20123;&#38382;&#39064;&#30340;&#19968;&#26465;&#31574;&#30053;&#23601;&#26159;&#65306;&#25552;&#21462;&#36719;&#20214;&#20849;&#24615;&#25104;&#20998;&#65292;&#23631;&#34109;&#31995;&#32479;&#20302;&#23618;&#30340;&#22797;&#26434;&#24230;&#65292;&#20174;&#32780;&#22312;&#39640;&#23618;&#20445;&#25345;&#22797;&#26434;&#24230;&#30340;&#30456;&#23545;&#31283;&#23450;&#12290;&#37319;&#29992;&#20102;&#36825;&#19968;&#31574;&#30053;&#30340;&#20856;&#22411;&#23601;&#26159;&#25805;&#20316;&#31995;&#32479;&#65292;&#25968;&#25454;&#24211;&#31649;&#29702;&#31995;&#32479;&#65292;&#21644;&#24212;&#29992;&#26381;&#21153;&#22120;&#12290;</p>
			<p>&#26681;&#25454;&#21069;&#36848;&#29702;&#30001;&#21487;&#20197;&#30693;&#36947;&#65292;&#19968;&#20010;&#20855;&#20307;&#30340;&#24212;&#29992;&#31995;&#32479;&#65292;&#22914;&#32593;&#32476;&#36719;&#20214;&#65292;&#30452;&#25509;&#20174;&#25805;&#20316;&#31995;&#32479;&#23618;&#24320;&#22987;&#24320;&#21457;&#26159;&#19981;&#21512;&#29702;&#30340;&#65292;&#32780;&#24212;&#35813;&#20197;&#19968;&#20010;&#30456;&#23545;&#39640;&#23618;&#30340;&#24179;&#21488;&#20026;&#36215;&#28857;&#12290;&#36825;&#20010;&#24179;&#21488;&#20026;&#24212;&#29992;&#31995;&#32479;&#30340;&#24320;&#21457;&#12289;&#32500;&#25252;&#25552;&#20379;&#22522;&#30784;&#12290;&#24212;&#29992;&#26381;&#21153;&#22120;&#23558;&#32593;&#32476;&#36719;&#20214;&#30340;&#20849;&#24615;&#25104;&#20998;&#20174;&#24212;&#29992;&#31995;&#32479;&#20013;&#21093;&#31163;&#20986;&#26469;&#65292;&#26500;&#25104;&#30456;&#23545;&#23436;&#25972;&#12289;&#29420;&#31435;&#30340;&#31995;&#32479;&#36719;&#20214;&#65307;&#22240;&#20854;&#23631;&#34109;&#20102;&#20302;&#23618;&#32593;&#32476;&#32454;&#33410;&#65292;&#26159;&#24320;&#21457;&#32773;&#33021;&#22815;&#23558;&#31934;&#21147;&#38598;&#20013;&#20110;&#30446;&#26631;&#31995;&#32479;&#30340;&#19994;&#21153;&#36923;&#36753;&#19978;&#65292;&#20174;&#32780;&#31616;&#21270;&#24212;&#29992;&#31995;&#32479;&#30340;&#24320;&#21457;&#21644;&#32500;&#25252;&#30340;&#36807;&#31243;&#12290;&#26159;&#19981;&#26159;&#24456;&#20687;&#25805;&#20316;&#31995;&#32479;&#65311;&#25805;&#20316;&#31995;&#32479;&#23631;&#34109;&#20102;&#20302;&#23618;&#30828;&#20214;&#32454;&#33410;&#65292;&#20026;&#35745;&#31639;&#26426;&#20351;&#29992;&#32773;&#25552;&#20379;&#30340;&#26159;&#19968;&#31995;&#21015;&#24212;&#29992;&#25509;&#21475;&#65292;&#23637;&#31034;&#20102;&#35745;&#31639;&#26426;&#22312;&#36923;&#36753;&#23618;&#38754;&#30340;&#24212;&#29992;&#12290;</p>
			<p>&#32437;&#21521;&#26469;&#30475;&#65292;&#24212;&#29992;&#26381;&#21153;&#22120;&#20301;&#20110;&#25805;&#20316;&#31995;&#32479;&#20043;&#19978;&#65292;&#24212;&#29992;&#31995;&#32479;&#20043;&#19979;&#65307;&#27178;&#21521;&#26469;&#30475;&#65292;&#24212;&#29992;&#26381;&#21153;&#22120;&#20301;&#20110;&#36719;&#20214;&#30340;&#34920;&#31034;&#23618;&#21644;&#25968;&#25454;&#23618;&#20043;&#38388;&#30340;&#19994;&#21153;&#36923;&#36753;&#23618;&#12290;</p>
		</div>
		<div class="sect2" title="&#24212;&#29992;&#26381;&#21153;&#22120;&#30340;&#21151;&#33021;"><div class="titlepage"><div><div><h3 class="title"><a name="N2141E"></a>&#24212;&#29992;&#26381;&#21153;&#22120;&#30340;&#21151;&#33021;</h3></div></div></div>
			<p>&#20855;&#20307;&#26469;&#35828;&#65292;&#24212;&#29992;&#26381;&#21153;&#22120;&#26377;&#20197;&#19979;&#21151;&#33021;&#65306;</p>
			<div class="itemizedlist"><ul class="itemizedlist" type="disc"><li class="listitem"><p>&#36890;&#36807;&#26500;&#20214;&#23481;&#22120;&#20026;&#26500;&#24314;&#25552;&#20379;&#22522;&#26412;&#30340;&#36816;&#34892;&#29615;&#22659;&#65292;&#21253;&#25324;&#31649;&#29702;&#26500;&#20214;&#29983;&#21629;&#21608;&#26399;&#12289;&#31649;&#29702;&#26500;&#20214;&#30340;&#23454;&#20363;&#12289;&#31649;&#29702;&#26500;&#24314;&#30340;&#20449;&#24687;&#31561;&#65307;</p>	
				</li><li class="listitem"><p>&#25552;&#20379;&#39640;&#23618;&#36890;&#20449;&#26381;&#21153;&#65292;&#20197;&#28385;&#36275;&#32593;&#32476;&#29615;&#22659;&#20013;&#30340;&#26500;&#20214;&#20043;&#38388;&#30340;&#20114;&#25805;&#20316;&#65292;&#21253;&#25324;&#19994;&#21153;&#23618;&#19982;&#34920;&#31034;&#23618;&#20043;&#38388;&#30340;&#36890;&#20449;&#12289;&#19994;&#21153;&#23618;&#19982;&#25968;&#25454;&#23618;&#20043;&#38388;&#30340;&#36890;&#20449;&#12289;&#19994;&#21153;&#23618;&#20869;&#37096;&#20844;&#20849;&#26381;&#21153;&#19982;&#24212;&#29992;&#23618;&#20043;&#38388;&#30340;&#36890;&#20449;&#65307;</p>			
				</li><li class="listitem"><p>&#25552;&#20379;&#20844;&#20849;&#26381;&#21153;&#65292;&#21253;&#25324;&#26597;&#25214;&#26381;&#21153;&#12289;&#20107;&#21153;&#26381;&#21153;&#21644;&#23433;&#20840;&#26381;&#21153;&#12290;</p>
				</li></ul></div>
		</div>
	</div><div class="navfooter"><hr><table summary="Navigation footer" width="100%"><tr><td align="left" width="40%"><a accesskey="p" href="ch14.html">&#19978;&#19968;&#39029;</a>&nbsp;</td><td align="center" width="20%"><a accesskey="u" href="ch14.html">&#19978;&#19968;&#32423;</a></td><td align="right" width="40%">&nbsp;<a accesskey="n" href="ch14s03.html">&#19979;&#19968;&#39029;</a></td></tr><tr><td valign="top" align="left" width="40%">&#31532;&nbsp;14&nbsp;&#31456;&nbsp;PKUAS&#24212;&#29992;&#24320;&#21457;&#25351;&#21335;&nbsp;</td><td align="center" width="20%"><a accesskey="h" href="index.html">&#36215;&#22987;&#39029;</a></td><td valign="top" align="right" width="40%">&nbsp;&#20934;&#22791;&#24037;&#20316;</td></tr></table></div></body></html>